org/_posts/2012-01-22-cascalog-testing-20.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_HTML
---
layout: post
title: Cascalog Testing 2.0
---

<p class="meta">22 Jan 2012 - San Francisco</p>
#+END_HTML

* Cascalog Testing 2.0

A few months ago I announced [[http://sritchie.github.com/2011/09/30/testing-cascalog-with-midje.html][Midje-Cascalog]], my layer of Midje testing macros over the [[www.cascalog.org][Cascalog]] MapReduce DSL. These allow you to write tests for your Cascalog jobs in a style that mimics Cascalog's own query execution syntax. In this post I discuss midje-cascalog's 0.4.0 release, which brings tighter Midje integration and a number of new ways to write tests. I'll start with a refresher on the old syntax before debuting the new. If you're eager, add the following to your project.clj:

#+begin_src clojure
[midje-cascalog "0.4.0"]
#+end_src

** Midje-Cascalog Refresher

Take the following Cascalog query:

#+begin_src clojure
  (use 'cascalog.api)
  
  (let [src [["word"]]]
    (?<- (stdout)
         [?out-word]
         (src ?word)
         (str ?word " up!" :> ?out-word)))
#+end_src

Executing this code at the repl prints a single tuple with the string =word up!= to standard out.

How would you go about testing that this is true? With midje-cascalog, you would swap out the =?<-= form for its testing equivalent: =fact?<-=. Here's the same Cascalog test alongside a typical Midje test:

#+begin_src clojure
  (let [src [["word"]]]
    (fact?<- [["word up!"]]
             [?out-word]
             (src ?word)
             (str ?word " up!" :> ?out-word)))
  
  (fact "+ should add two numbers."
    (+ 2 2) => 4)
#+end_src

I find that =fact?<-= and =fact?-= macros can be a bit confusing when you start mixing Cascalog and Midje tests, as they break the Midje pattern of =<thing-to-test> => <expected-thing>=. The syntax updates fix all of this with a set of checker functions that mimic Midje's excellent [[https://github.com/marick/Midje/wiki/Checkers-for-collections-and-strings][set of collection checkers]].

** The "produces" checker

Midje-cascalog 0.4.0 introduces the =produces= function, mirroring Midje's =just=. Let's define a source of tuples and a query to test.

#+begin_src clojure
  (use 'cascalog.api)
  (require '[cascalog.ops :as c])
  
  (def src
    [[1 2] [1 3]
     [3 4] [3 6]
     [5 2] [5 9]])
  
  ;; adds the values in each input tuple, sorts the output and returns
  ;; 2-tuples of the first number and the sum. [1 2] becomes [1 3], for
  ;; example.
  (def query
    (<- [?x ?sum]
        (src ?x ?y)
        (:sort ?x)
        (c/sum ?y :> ?sum)))  
#+end_src

You can think of a query as a set of tuples waiting to be generated (through query execution). With Midje, you test sets using the =just= checker:

#+begin_src clojure
  (facts
    [1 2 3] => (just [1 2 3])    ;; true
    [1 2 3] => (just [1 2 3 4])) ;; false
#+end_src

The cascalog analog to =just= is the =produces= checker. =produces= works like =just=, but against queries instead of bare collections. Executing the following test shows that the query produces the expected set of pairs, in any order:

#+begin_src clojure
  (facts
    query => (produces [[3 10] [1 5] [5 11]])  ;; true
    query => (produces [[1 5] [3 10] [5 11]])) ;; true  
#+end_src

You can read this test as saying "query, when executed, produces [3 10], [1 5] and [5 11]. You can also check that a query *doesn't* produce a set of tuples by swapping out =not=> for =>:

#+begin_src clojure
  (fact
    query =not=> (produces [["string!" 11] [1 5] [5 11]])) ;; true
#+end_src

Using the =:in-order= keyword after the expected tuple sequence forces the test to respect ordering:

#+begin_src clojure
  (facts    
    query =not=> (produces [[3 10] [5 11] [1 5]] :in-order) ;; true
    query => (produces [[1 5] [3 10] [5 11]] :in-order))    ;; true
#+end_src

(=:in-order= is really only helpful in cases where output is sorted, like our query above.)

