_posts/2012-01-22-cascalog-testing-20.html
---
layout: post
title: Cascalog Testing 2.0
---

<p class="meta">22 Jan 2012 - San Francisco</p>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Cascalog Testing 2.0</h2>
<div class="outline-text-2" id="text-1">


<p>
A few months ago I announced <a href="http://sritchie.github.com/2011/09/30/testing-cascalog-with-midje.html">Midje-Cascalog</a>, my layer of Midje testing macros over the <a href="#www.cascalog.org">Cascalog</a> MapReduce DSL. These allow you to write tests for your Cascalog jobs in a style that mimics Cascalog's own query execution syntax. In this post I discuss midje-cascalog's 0.4.0 release, which brings tighter Midje integration and a number of new ways to write tests. I'll start with a refresher on the old syntax before debuting the new. If you're eager, add the following to your project.clj:
</p>



<pre class="src src-clojure">[midje-cascalog <span style="color: #259185;">"0.4.0"</span>]
</pre>



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Midje-Cascalog Refresher</h3>
<div class="outline-text-3" id="text-1-1">


<p>
Take the following Cascalog query:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05;">use</span> 'cascalog.api<span style="color: #7f7f7f;">)</span>

<span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">let</span> [src [[<span style="color: #259185;">"word"</span>]]]
  <span style="color: #7f7f7f;">(</span>?&lt;- <span style="color: #7f7f7f;">(</span>stdout<span style="color: #7f7f7f;">)</span>
       [?out-word]
       <span style="color: #7f7f7f;">(</span>src ?word<span style="color: #7f7f7f;">)</span>
       <span style="color: #7f7f7f;">(</span><span style="color: #728a05;">str</span> ?word <span style="color: #259185;">" up!"</span> <span style="color: #259185; font-weight: bold;">:&gt;</span> ?out-word<span style="color: #7f7f7f;">)))</span>
</pre>


<p>
Executing this code at the repl prints a single tuple with the string <code>word up!</code> to standard out.
</p>
<p>
How would you go about testing that this is true? With midje-cascalog, you would swap out the <code>?&lt;-</code> form for its testing equivalent: <code>fact?&lt;-</code>. Here's the same Cascalog test alongside a typical Midje test:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">let</span> [src [[<span style="color: #259185;">"word"</span>]]]
  <span style="color: #7f7f7f;">(</span>fact?&lt;- [[<span style="color: #259185;">"word up!"</span>]]
           [?out-word]
           <span style="color: #7f7f7f;">(</span>src ?word<span style="color: #7f7f7f;">)</span>
           <span style="color: #7f7f7f;">(</span><span style="color: #728a05;">str</span> ?word <span style="color: #259185;">" up!"</span> <span style="color: #259185; font-weight: bold;">:&gt;</span> ?out-word<span style="color: #7f7f7f;">)))</span>

<span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">fact</span> <span style="color: #259185;">"+ should add two numbers."</span>
  <span style="color: #7f7f7f;">(</span><span style="color: #728a05;">+</span> 2 2<span style="color: #7f7f7f;">)</span> <span style="color: #c60007; font-weight: bold;">=&gt;</span> 4<span style="color: #7f7f7f;">)</span>
</pre>


<p>
I find that <code>fact?&lt;-</code> and <code>fact?-</code> macros can be a bit confusing when you start mixing Cascalog and Midje tests, as they break the Midje pattern of <code>&lt;thing-to-test&gt; =&gt; &lt;expected-thing&gt;</code>. The syntax updates fix all of this with a set of checker functions that mimic Midje's excellent <a href="https://github.com/marick/Midje/wiki/Checkers-for-collections-and-strings">set of collection checkers</a>.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">The "produces" checker</h3>
<div class="outline-text-3" id="text-1-2">


<p>
Midje-cascalog 0.4.0 introduces the <code>produces</code> function, mirroring Midje's <code>just</code>. Let's define a source of tuples and a query to test.
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05;">use</span> 'cascalog.api<span style="color: #7f7f7f;">)</span>
<span style="color: #7f7f7f;">(</span><span style="color: #728a05;">require</span> '[cascalog.ops <span style="color: #259185; font-weight: bold;">:as</span> c]<span style="color: #7f7f7f;">)</span>

<span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">def</span> <span style="color: #2075c7;">src</span>
  [[1 2] [1 3]
   [3 4] [3 6]
   [5 2] [5 9]]<span style="color: #7f7f7f;">)</span>

<span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">adds the values in each input tuple, sorts the output and returns</span>
<span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">2-tuples of the first number and the sum. [1 2] becomes [1 3], for</span>
<span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">example.</span>
<span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">def</span> <span style="color: #2075c7;">query</span>
  <span style="color: #7f7f7f;">(</span>&lt;- [?x ?sum]
      <span style="color: #7f7f7f;">(</span>src ?x ?y<span style="color: #7f7f7f;">)</span>
      <span style="color: #7f7f7f;">(</span><span style="color: #259185; font-weight: bold;">:sort</span> ?x<span style="color: #7f7f7f;">)</span>
      <span style="color: #7f7f7f;">(</span>c/sum ?y <span style="color: #259185; font-weight: bold;">:&gt;</span> ?sum<span style="color: #7f7f7f;">)))</span>
</pre>


<p>
You can think of a query as a set of tuples waiting to be generated (through query execution). With Midje, you test sets using the <code>just</code> checker:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">facts</span>
  [1 2 3] <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span><span style="color: #a57705; font-weight: bold;">just</span> [1 2 3]<span style="color: #7f7f7f;">)</span>    <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
  [1 2 3] <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span><span style="color: #a57705; font-weight: bold;">just</span> [1 2 3 4]<span style="color: #7f7f7f;">))</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">false</span>
</pre>


<p>
The cascalog analog to <code>just</code> is the <code>produces</code> checker. <code>produces</code> works like <code>just</code>, but against queries instead of bare collections. Executing the following test shows that the query produces the expected set of pairs, in any order:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">facts</span>
  query <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>produces [[3 10] [1 5] [5 11]]<span style="color: #7f7f7f;">)</span>  <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
  query <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>produces [[1 5] [3 10] [5 11]]<span style="color: #7f7f7f;">))</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true  </span>
</pre>


<p>
You can read this test as saying "query, when executed, produces [3 10], [1 5] and [5 11]. You can also check that a query <b>doesn't</b> produce a set of tuples by swapping out =not=&gt; for =&gt;:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">fact</span>
  query <span style="color: #c60007; font-weight: bold;">=not=&gt;</span> <span style="color: #7f7f7f;">(</span>produces [[<span style="color: #259185;">"string!"</span> 11] [1 5] [5 11]]<span style="color: #7f7f7f;">))</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
</pre>


<p>
Using the <code>:in-order</code> keyword after the expected tuple sequence forces the test to respect ordering:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">facts</span>
  query <span style="color: #c60007; font-weight: bold;">=not=&gt;</span> <span style="color: #7f7f7f;">(</span>produces [[3 10] [5 11] [1 5]] <span style="color: #259185; font-weight: bold;">:in-order</span><span style="color: #7f7f7f;">)</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
  query <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>produces [[1 5] [3 10] [5 11]] <span style="color: #259185; font-weight: bold;">:in-order</span><span style="color: #7f7f7f;">))</span>    <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
</pre>


<p>
(<code>:in-order</code> is really only helpful in cases where output is sorted, like our query above.)
</p>
</div>

</div>
