org/_posts/2012-01-22-cascalog-testing-20.org
** produces-some

The =produces-some= checker tests that a query's output contains a subset of tuples:

#+begin_src clojure    
  (fact
    query => (produces-some [[5 11] [1 5]])) ;; true
#+end_src

Note that the behaviour of =produces-some= is similar to the behavior of Midje's =contains= collection checker.

As with produces, you can use the =:in-order= keyword to force =produces-some= to respect ordering. Gaps between tuples are okay.

#+begin_src clojure    
  (facts
    query =not=> (produces-some [[5 11] [1 5]] :in-order) ;; true
    query => (produces-some [[1 5] [5 11]] :in-order))    ;; true
#+end_src

Adding the =:no-gaps= keyword introduces the constraint that tuples must also be contiguous:

#+begin_src clojure    
  (facts    
    query =not=> (produces-some [[1 5] [5 11]] :in-order :no-gaps) ;; true
    query => (produces-some [[1 5] [3 10]] :in-order :no-gaps))    ;; true
#+end_src

** produces-prefix and produces-suffix

=produce-prefix= mimics the =has-prefix= collection checker by checking that some set of tuples is produced at the beginning of the query's output. =produces-prefix= implicitly assumes that tuples will be produced in order with no gaps:

#+begin_src clojure    
  (facts    
    query => (produces-prefix [[1 5]])         ;; true
    query => (produces-prefix [[1 5] [3 10]])) ;; true
#+end_src

Similarly, =produce-suffix= mimics the =has-suffix= collection checker by checking that the supplied set of tuples is produced at the tail end of a query:

#+begin_src clojure    
  (facts
    query => (produces-suffix [[5 11]])) ;; true
#+end_src

** log-level keywords

In addition to the keyword options supported above, every one of these checkers supports on optional logging-level keyword. For example, the following two facts are equivalent, but the second one produces =:info= level logging when it runs:

#+begin_src clojure
  (facts
    query => (produces-suffix [[5 11]])        ;; true
    query => (produces-suffix [[5 11]] :info)) ;; true
#+end_src

Log level keywords can be useful when debugging tests, as errors will often only appear in the logging output. Currently supported keywords are =:off= (the default), =:fatal=, =:warn=, =:info= and =:debug=. The log level needs to be the first keyword argument if you supply multiple.

