_posts/2012-01-22-cascalog-testing-20.html

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">produces-some</h3>
<div class="outline-text-3" id="text-1-3">


<p>
The <code>produces-some</code> checker tests that a query's output contains a subset of tuples:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">fact</span>
  query <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>produces-some [[5 11] [1 5]]<span style="color: #7f7f7f;">))</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
</pre>


<p>
Note that the behaviour of <code>produces-some</code> is similar to the behavior of Midje's <code>contains</code> collection checker.
</p>
<p>
As with produces, you can use the <code>:in-order</code> keyword to force <code>produces-some</code> to respect ordering. Gaps between tuples are okay.
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">facts</span>
  query <span style="color: #c60007; font-weight: bold;">=not=&gt;</span> <span style="color: #7f7f7f;">(</span>produces-some [[5 11] [1 5]] <span style="color: #259185; font-weight: bold;">:in-order</span><span style="color: #7f7f7f;">)</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
  query <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>produces-some [[1 5] [5 11]] <span style="color: #259185; font-weight: bold;">:in-order</span><span style="color: #7f7f7f;">))</span>    <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
</pre>


<p>
Adding the <code>:no-gaps</code> keyword introduces the constraint that tuples must also be contiguous:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">facts</span>
  query <span style="color: #c60007; font-weight: bold;">=not=&gt;</span> <span style="color: #7f7f7f;">(</span>produces-some [[1 5] [5 11]] <span style="color: #259185; font-weight: bold;">:in-order</span> <span style="color: #259185; font-weight: bold;">:no-gaps</span><span style="color: #7f7f7f;">)</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
  query <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>produces-some [[1 5] [3 10]] <span style="color: #259185; font-weight: bold;">:in-order</span> <span style="color: #259185; font-weight: bold;">:no-gaps</span><span style="color: #7f7f7f;">))</span>    <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
</pre>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">produces-prefix and produces-suffix</h3>
<div class="outline-text-3" id="text-1-4">


<p>
<code>produce-prefix</code> mimics the <code>has-prefix</code> collection checker by checking that some set of tuples is produced at the beginning of the query's output. <code>produces-prefix</code> implicitly assumes that tuples will be produced in order with no gaps:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">facts</span>
  query <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>produces-prefix [[1 5]]<span style="color: #7f7f7f;">)</span>         <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
  query <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>produces-prefix [[1 5] [3 10]]<span style="color: #7f7f7f;">))</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
</pre>


<p>
Similarly, <code>produce-suffix</code> mimics the <code>has-suffix</code> collection checker by checking that the supplied set of tuples is produced at the tail end of a query:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">facts</span>
  query <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>produces-suffix [[5 11]]<span style="color: #7f7f7f;">))</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
</pre>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">log-level keywords</h3>
<div class="outline-text-3" id="text-1-5">


<p>
In addition to the keyword options supported above, every one of these checkers supports on optional logging-level keyword. For example, the following two facts are equivalent, but the second one produces <code>:info</code> level logging when it runs:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">facts</span>
  query <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>produces-suffix [[5 11]]<span style="color: #7f7f7f;">)</span>        <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
  query <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>produces-suffix [[5 11]] <span style="color: #259185; font-weight: bold;">:info</span><span style="color: #7f7f7f;">))</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
</pre>


<p>
Log level keywords can be useful when debugging tests, as errors will often only appear in the logging output. Currently supported keywords are <code>:off</code> (the default), <code>:fatal</code>, <code>:warn</code>, <code>:info</code> and <code>:debug</code>. The log level needs to be the first keyword argument if you supply multiple.
</p>
</div>

</div>
