org/_posts/2012-01-22-cascalog-testing-20.org
** wrap-checker

The real power of the =0.4.0= update is the way in which the previous query checkers were defined. Each of the above checkers mimics the behavior of one of Midje's built-in collection checkers with slightly different keyword arguments. This makes sense if you think of a query as a collection of tuples waiting to be produced (by query execution). The above checkers will get you quite a ways, but what if you want to test a query against some other Midje collection checker?

The answer is =wrap-checker=. =wrap-checker= is a higher-order function that accepts a midje collection checker and wraps it up, turning it into a Cascalog query checker. I'll demonstrate the power of this function by wrapping  Midje's =has= checker.

=has= is a powerful way to run functions across every value in some sequence:

#+begin_src clojure
  (fact
    [1 3 5 7 9] => (has every? odd?) ;; true
    [1 3 5 6] => (has some even?))   ;; true
#+end_src

If you try to use =has= against a query it will fail, as it expects to be tested against a sequence, not an unexecuted query. Here's how to get around this:

#+begin_src clojure
  (defn odd-tuple? [tuple]
    (odd? (first tuple)))
  
  (defn even-tuple? [tuple]
    (even? (first tuple)))

  (def has-tuples
    (wrap-checker has))
  
  (def new-query
    (let [src [[1] [3] [5]]]
      (<- [?x] (src ?x))))
  
  (fact
    new-query     => (has-tuples every? odd-tuple?) ;; true
    new-query =not=> (has-tuples some even-tuple?)) ;; true  
  
#+end_src

=has-tuples= will support log-level keywords like any of the predefined query collection checkers.

A few more examples:

#+begin_src clojure  
  (defn id-query [src]
    (<- [?x] (src ?x)))
  
  (let [one-of-tuples (wrap-checker one-of)
        two-of-tuples (wrap-checker two-of)
        src [[1] [3] [4]]]
    (facts
      src            => (two-of odd-tuple?)           ;; true
      src            => (one-of even-tuple?)          ;; true
      (id-query src) => (two-of-tuples odd-tuple?)    ;; true
      (id-query src) => (one-of-tuples even-tuple?))) ;; true  
#+end_src

** Backwards Compatibility

All of the collection checkers discussed above can be used with the =fact?<-= and =fact?-= macros:

#+begin_src clojure
  (fact<- (produces-some [[5 11] [1 5]] :in-order)
          [?x ?sum]
          (src ?x ?y)
          (:sort ?x)
          (c/sum ?y :> ?sum)) ;; true
#+end_src

=fact?<-= and =fact?-= are also compatible with all of Midje's unwrapped collection checkers, as discussed [[http://sritchie.github.com/2011/09/30/testing-cascalog-with-midje.html][here]].

** Conclusion

Midje is an astonishingly good testing framework; I'm continually surprised by how well its idioms and conventions satisfy Cascalog's needs. In my next post here I'll go over some of the more subtle details of the =wrap-checker= function. For the curious, [[https://github.com/sritchie/midje-cascalog/blob/develop/src/midje/cascalog.clj#L39][here's the code]].

If you'd like more information or additional features, please add your thoughts to the [[https://github.com/sritchie/midje-cascalog/issues][midje-cascalog github issues page]], or let me know in the comments below (or on twitter! I'm [[www.twitter.com/sritchie09][@sritchie09]].)
