_posts/2012-01-22-cascalog-testing-20.html

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6">wrap-checker</h3>
<div class="outline-text-3" id="text-1-6">


<p>
The real power of the <code>0.4.0</code> update is the way in which the previous query checkers were defined. Each of the above checkers mimics the behavior of one of Midje's built-in collection checkers with slightly different keyword arguments. This makes sense if you think of a query as a collection of tuples waiting to be produced (by query execution). The above checkers will get you quite a ways, but what if you want to test a query against some other Midje collection checker?
</p>
<p>
The answer is <code>wrap-checker</code>. <code>wrap-checker</code> is a higher-order function that accepts a midje collection checker and wraps it up, turning it into a Cascalog query checker. I'll demonstrate the power of this function by wrapping  Midje's <code>has</code> checker.
</p>
<p>
<code>has</code> is a powerful way to run functions across every value in some sequence:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">fact</span>
  [1 3 5 7 9] <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span><span style="color: #a57705; font-weight: bold;">has</span> every? odd?<span style="color: #7f7f7f;">)</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
  [1 3 5 6] <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span><span style="color: #a57705; font-weight: bold;">has</span> some even?<span style="color: #7f7f7f;">))</span>   <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
</pre>


<p>
If you try to use <code>has</code> against a query it will fail, as it expects to be tested against a sequence, not an unexecuted query. Here's how to get around this:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">defn</span> <span style="color: #2075c7;">odd-tuple?</span> [tuple]
  <span style="color: #7f7f7f;">(</span><span style="color: #728a05;">odd?</span> <span style="color: #7f7f7f;">(</span><span style="color: #728a05;">first</span> tuple<span style="color: #7f7f7f;">)))</span>

<span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">defn</span> <span style="color: #2075c7;">even-tuple?</span> [tuple]
  <span style="color: #7f7f7f;">(</span><span style="color: #728a05;">even?</span> <span style="color: #7f7f7f;">(</span><span style="color: #728a05;">first</span> tuple<span style="color: #7f7f7f;">)))</span>

<span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">def</span> <span style="color: #2075c7;">has-tuples</span>
  <span style="color: #7f7f7f;">(</span>wrap-checker <span style="color: #a57705; font-weight: bold;">has</span><span style="color: #7f7f7f;">))</span>

<span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">def</span> <span style="color: #2075c7;">new-query</span>
  <span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">let</span> [src [[1] [3] [5]]]
    <span style="color: #7f7f7f;">(</span>&lt;- [?x] <span style="color: #7f7f7f;">(</span>src ?x<span style="color: #7f7f7f;">))))</span>

<span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">fact</span>
  new-query     <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>has-tuples every? odd-tuple?<span style="color: #7f7f7f;">)</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
  new-query <span style="color: #c60007; font-weight: bold;">=not=&gt;</span> <span style="color: #7f7f7f;">(</span>has-tuples some even-tuple?<span style="color: #7f7f7f;">))</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true  </span>

</pre>


<p>
<code>has-tuples</code> will support log-level keywords like any of the predefined query collection checkers.
</p>
<p>
A few more examples:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">defn</span> <span style="color: #2075c7;">id-query</span> [src]
  <span style="color: #7f7f7f;">(</span>&lt;- [?x] <span style="color: #7f7f7f;">(</span>src ?x<span style="color: #7f7f7f;">)))</span>

<span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">let</span> [one-of-tuples <span style="color: #7f7f7f;">(</span>wrap-checker one-of<span style="color: #7f7f7f;">)</span>
      two-of-tuples <span style="color: #7f7f7f;">(</span>wrap-checker two-of<span style="color: #7f7f7f;">)</span>
      src [[1] [3] [4]]]
  <span style="color: #7f7f7f;">(</span><span style="color: #728a05; font-weight: bold;">facts</span>
    src            <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>two-of odd-tuple?<span style="color: #7f7f7f;">)</span>           <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
    src            <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>one-of even-tuple?<span style="color: #7f7f7f;">)</span>          <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
    <span style="color: #7f7f7f;">(</span>id-query src<span style="color: #7f7f7f;">)</span> <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>two-of-tuples odd-tuple?<span style="color: #7f7f7f;">)</span>    <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
    <span style="color: #7f7f7f;">(</span>id-query src<span style="color: #7f7f7f;">)</span> <span style="color: #c60007; font-weight: bold;">=&gt;</span> <span style="color: #7f7f7f;">(</span>one-of-tuples even-tuple?<span style="color: #7f7f7f;">)))</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true  </span>
</pre>


</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7">Backwards Compatibility</h3>
<div class="outline-text-3" id="text-1-7">


<p>
All of the collection checkers discussed above can be used with the <code>fact?&lt;-</code> and <code>fact?-</code> macros:
</p>



<pre class="src src-clojure"><span style="color: #7f7f7f;">(</span>fact?&lt;- <span style="color: #7f7f7f;">(</span>produces-some [[1 5] [5 11]] <span style="color: #259185; font-weight: bold;">:in-order</span><span style="color: #7f7f7f;">)</span>
         [?x ?sum]
         <span style="color: #7f7f7f;">(</span>src ?x ?y<span style="color: #7f7f7f;">)</span>
         <span style="color: #7f7f7f;">(</span><span style="color: #259185; font-weight: bold;">:sort</span> ?x<span style="color: #7f7f7f;">)</span>
         <span style="color: #7f7f7f;">(</span>c/sum ?y <span style="color: #259185; font-weight: bold;">:&gt;</span> ?sum<span style="color: #7f7f7f;">))</span> <span style="color: #465a61; font-weight: bold;">;; </span><span style="color: #465a61; font-style: italic;">true</span>
</pre>


<p>
<code>fact?&lt;-</code> and <code>fact?-</code> are also compatible with all of Midje's unwrapped collection checkers, as discussed <a href="http://sritchie.github.com/2011/09/30/testing-cascalog-with-midje.html">here</a>.
</p>
</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8">Conclusion</h3>
<div class="outline-text-3" id="text-1-8">


<p>
Midje is an astonishingly good testing framework; I'm continually surprised by how well its idioms and conventions satisfy Cascalog's needs. In my next post here I'll go over some of the more subtle details of the <code>wrap-checker</code> function. For the curious, <a href="https://github.com/sritchie/midje-cascalog/blob/develop/src/midje/cascalog.clj#L39">here's the code</a>.
</p>
<p>
If you'd like more information or additional features, please add your thoughts to the <a href="https://github.com/sritchie/midje-cascalog/issues">midje-cascalog github issues page</a>, or let me know in the comments below (or on twitter! I'm <a href="#www.twitter.com-sritchie09">@sritchie09</a>.)
</p></div>
</div>
</div>
